{
    "relevant_title": "The main job title or role of the person is not explicitly stated, but based on the provided information, it appears that Naman Verma is a software developer or engineer, possibly specializing in areas such as artificial intelligence, machine learning, or full-stack development.",
    "years_of_experience": "Based on the provided information, Naman Verma has the following experience:\n\n- Graphic and UI/UX Designer at Google Developer Students Club Chennai: October 2022 - August 2024 (approximately 2 years)\n- Android Developer Intern at Karking: September 2023 - January 2024 (approximately 4-5 months)\n\nConsidering these periods, Naman Verma has around 2-2.5 years of experience.",
    "techstack": "Based on the provided information, the person is proficient in the following technologies, tools, and frameworks:\n\n1. Programming Languages:\n   - C++\n   - Python\n   - JavaScript\n   - SQL\n   - Java\n\n2. Technologies:\n   - Firebase\n   - Amazon Web Services (AWS)\n   - REST API\n   - Docker\n   - Kubernetes\n\n3. Frameworks and Libraries:\n   - Flutter\n   - React\n   - LangChain\n   - Streamlit\n\n4. Softwares and Tools:\n   - Git\n   - Linux\n   - Oracle SQL\n   - Vercel\n\nNote that this list may not be exhaustive, as the person's experience and skills may extend beyond what is mentioned in the provided context.",
    "current_location": "The current location of the person, Naman Verma, is not explicitly stated, but based on the provided information, he is currently studying at Vellore Institute of Technology, Chennai. However, his contact information lists Shimla, India as his location.",
    "certifications": "The person has obtained the following certifications:\n\n1. Amazon Web Services (AWS) - Cloud Practitioner\n2. Amazon Web Services (AWS) - Solutions Architect Associate",
    "native_languages_known": "I don't know what languages this person speaks natively. The provided information only lists the programming languages they are familiar with (C++, Python, JavaScript, SQL, Java), but does not mention their native language.",
    "computer_languages_known": "According to the provided information, Naman Verma knows the following programming or computer languages:\n\n1. C++\n2. Python\n3. JavaScript\n4. SQL\n5. Java"
}